clackups/draftling/firmware/sdkconfig.defaults.waveshare_touch_lcd_349
# CMakePresets.json board defaults: Waveshare ESP32-S3-Touch-LCD-3.49
# Sets the hardware model and IDF target used by the "waveshare_touch_lcd_349" preset.

CONFIG_IDF_TARGET="esp32s3"
CONFIG_DRAFTLING_MODEL_WAVESHARE_TOUCH_LCD_349=y

# "SD card via USB" (F1 menu): expose the on-board MicroSD as a USB
# Mass Storage device over the ESP32-S3's native USB port. See
# components/usb_msc.
CONFIG_TINYUSB_MSC_ENABLED=y
